[
  {"id": "Q1", "text": "Do you gain a big-picture understanding of a new topic before learning the details?", "type": "likert5", "domain": "priming"},
  {"id": "Q2", "text": "Do you spend time to briefly look through the topic before classes, lectures, or long study sessions?", "type": "likert5", "domain": "priming"},
  {"id": "Q3", "text": "Do you think of how the main ideas of a topic might relate to each other before learning about each idea more deeply?", "type": "likert5", "domain": "priming"},
  {"id": "Q4", "text": "Do you map out a basic understanding of your thoughts to use as a scaffold when learning more deeply?", "type": "likert5", "domain": "priming"},
  {"id": "Q5", "text": "Do you look for how ideas, facts, and concepts may influence each other?", "type": "likert5", "domain": "priming"},
  {"id": "Q6", "text": "Do you constantly relate new information to a big-picture understanding of importance or relevance?", "type": "likert5", "domain": "priming"},
  {"id": "Q7", "text": "Do you look for ways to make new information more relevant, intuitive, and simple to understand?", "type": "likert5", "domain": "priming"},
  {"id": "Q8", "text": "Do you actively try and find ways to organise information that reduces the need for rote memorisation?", "type": "likert5", "domain": "reference"},
  {"id": "Q9", "text": "Do you actively group and rearrange information so that it is more organised?", "type": "likert5", "domain": "reference"},
  {"id": "Q10", "text": "Do you actively look for alternative ways of organising information that is different to how it was taught?", "type": "likert5", "domain": "reference"},
  {"id": "Q11", "text": "Do you try to create analogies for new ideas that are initially complicated to understand or remember?", "type": "likert5", "domain": "priming"},
  {"id": "Q12", "text": "Do you regularly pause when consuming new information so that you can make the information you've already consumed more intuitive and organised, to prevent yourself from being overloaded by the stream of new, unorganised information?", "type": "likert5", "domain": "priming"},
  {"id": "Q13", "text": "Do you use note-taking to help visually organise your thoughts so that your mental effort can be used to explore how concepts are related to each other, group and organise information, simplify and make new information more intuitive, and connect information to the big picture?", "type": "likert5", "domain": "reference"},
  {"id": "Q14", "text": "Do you write and store detailed information that needs to be referred back to later (e.g. facts and figures, statistics, etc.) in a different way than conceptual information?", "type": "likert5", "domain": "reference"},
  {"id": "Q15", "text": "Do you minimise the usage of linear notes when learning conceptual information?", "type": "likert5", "domain": "reference"},
  {"id": "Q16", "text": "Do you use substantial non-linear note-taking to represent relationships between concepts when learning conceptual information?", "type": "likert5", "domain": "reference"},
  {"id": "Q17", "text": "Do you write many notes that you do not read again?", "type": "likert5", "domain": "reference", "reverse": true},
  {"id": "Q18", "text": "Do you spend a significant amount of time writing notes that do not help you to: connect information to the big picture, make new information simpler and more intuitive, group and rearrange ideas, create analogies, or explore how ideas are related to each other?", "type": "likert5", "domain": "reference", "reverse": true},
  {"id": "Q19", "text": "Do you use and apply knowledge you have learned from memory within the first week of learning it?", "type": "likert5", "domain": "retrieval"},
  {"id": "Q20", "text": "Do you use and apply knowledge you have learned from memory within the first month of learning it?", "type": "likert5", "domain": "retrieval"},
  {"id": "Q21", "text": "Do you test your knowledge (in any form, deliberately or opportunistically) to identify gaps in your knowledge?", "type": "likert5", "domain": "retrieval"},
  {"id": "Q22", "text": "Do you try to fill gaps in knowledge by approaching the information from a different perspective or looking for new connections and relationships compared to the first time?", "type": "likert5", "domain": "retrieval"},
  {"id": "Q23", "text": "Do you recall and apply your knowledge from memory in multiple ways (e.g. answering diverse types of problems/questions or applying your knowledge in diverse contexts)?", "type": "likert5", "domain": "retrieval"},
  {"id": "Q24", "text": "Do you reinforce your learning for isolated facts with a different method (e.g. flashcards and spaced repetition) than for conceptual learning?", "type": "likert5", "domain": "retrieval"},
  {"id": "Q25", "text": "Do you learn more than you think you need to in order to strengthen your knowledge of core material?", "type": "likert5", "domain": "overlearning"},
  {"id": "Q26", "text": "Do you use techniques that involve repetitive recall from memory to increase the consistency and speed of your recall accuracy? These techniques often rely on high volumes such as doing a large number of quizzes, practice questions or flashcards (if necessary and relevant).", "type": "likert5", "domain": "overlearning"},
  {"id": "Q27", "text": "In the early stages of learning a new topic, do you use high-volume techniques such as doing a large number of quizzes, practice questions or flashcards (if necessary and relevant)?", "type": "likert5", "domain": "overlearning", "reverse": true},
  {"id": "Q28", "text": "Do you spend time to actively look for ways your knowledge may be tested that may be beyond your expected scope, to look for weaknesses and improve mastery of core material?", "type": "likert5", "domain": "retrieval"}
]